export default function LinkedInIcon() {
  return (
    <svg
      xmlns="http://www.w3.org/2000/svg"
      width="39.717"
      height="39.717"
      viewBox="0 0 39.717 39.717"
    >
      <path
        id="Tracé_3"
        data-name="Tracé 3"
        d="M105.122,0a19.859,19.859,0,1,0,19.858,19.86A19.861,19.861,0,0,0,105.122,0m-3.311,26.479H98.5v-9.93h3.311Zm-1.654-11.4a1.835,1.835,0,1,1,1.819-1.835,1.829,1.829,0,0,1-1.819,1.835m13.238,11.4h-3.307V21.743c0-3.112-3.313-2.848-3.313,0v4.736h-3.311v-9.93h3.311v1.809c1.443-2.673,6.619-2.872,6.619,2.562Z"
        transform="translate(-85.262)"
        fill="currentColor"
      />
    </svg>
  );
}
